{"backend": "tensorflow", "config": [{"config": {"trainable": true, "name": "global_average_pooling2d_2", "batch_input_shape": [null, 1, 1, 2048], "dtype": "float32", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"kernel_constraint": null, "trainable": true, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 133}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2"}